Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [16]:
import pandas as pd
data = [4,8,15,16,23,42]
df = pd.Series(data)
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

var = [1,2,3,4,5,6,7,8,9,10]
df1 = pd.Series(var)

In [12]:
df1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [17]:
data = {'Name':["Alice" , "Bob" , "Claire"] ,"Age":[25,30,27] , "Gender":['Female' , 'Male' , 'Female'] }

In [35]:
df1 = pd.DataFrame(data)

In [36]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

The Difference Between a DataFrame and Series is in DataFrame the structure of the holding a data is in columns, multiple columns are created in the dataframe where as in Series only a Single column is created to present the data. Inshort we can say that each column present in the DataFrame is represented by the Series.

In [41]:
#Here is the Example of the DataFrame
import pandas as pd
data = {"Name":['shubham','Prachyet','Mihir','Kshitij'] , "Age":[20,8,19,19], "Gender":['Male' , 'Female' , 'Male', 'Male']}
df = pd.DataFrame(data)

In [42]:
df

       Name  Age  Gender
0   shubham   20    Male
1  Prachyet    8  Female
2     Mihir   19    Male
3   Kshitij   19    Male

In [45]:
#Here is example for series
df1 = pd.Series([1,2,3,4,50] , name='numbers')
df1

0     1
1     2
2     3
3     4
4    50
Name: numbers, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

1)df.head()#To display 1st five rows.
 2)df.tail(4)#to display last 4 rows.
  3)df.describe()#it will give the statistical analized of the data , i.e mean , var ,max, min.
   4)df.columns#will gives the names of the columns.
    5)df.dtypes #will give the datatypes of the data.

In [47]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series and DataFrames are mutable as A Series is a one-dimensional array-like object in Pandas, and its elements can be modified after creation. where as A DataFrame is a two-dimensional tabular data structure. Like a Series, individual elements (cells) within a DataFrame can be modified. You can change values in specific rows and columns using indexing and assignment.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [48]:
import pandas as pd
s1 = pd.Series( ['shubham','Prachyet' ,'mihir'])
s2 = pd.Series([1,2,3])

data = {'name':s1 , 'age':s2}

In [49]:
df1 = pd.DataFrame(data)

In [50]:
df1

       name  age
0   shubham    1
1  Prachyet    2
2     mihir    3